app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
	  @post = Post.find_by_id(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Rails Intro: Not Really a Quiz"], ["description", "Not really a quiz!"], ["updated_at", "2018-08-03 13:05:48.125274"], ["id", 1]]
---
	def update
	  #raise params.inspect
	  @post = Post.find_by_id(params[:id])
	  @post.update(title: params[:title])